# 리소스 삭제

본 실습은 Day2 까지 실습을 진행하면서 만들어진 리소스를 삭제 하는 실습입니다.
불필요한 리소스 삭제는 비용을 절감하고 보안을 강화하며, 자원을 최적화하고 확장성을 향상시키며 운영 관리를 간소화하는데 도움을 줍니다.

## 1. 클라우드 리소스 삭제

1. Hadoop Eco > 클러스터 > 생성 되어있는 클러스터 오른쪽 (...) 클릭 > 클러스터 삭제 > 클러스터 이름 입력 > 삭제 버튼 클릭
2. Virtual Machine > 인스턴스 > 모두 체크 > 인스턴스 삭제 > 영구 삭제 > 삭제 버튼 클릭
3. Load Balancing > 로드 밸런서 > 생성 되어있는 로드 밸런서 오른쪽 (...) 클릭 > 로드 밸런서 삭제 > 로드 밸런서 이름 입력 > 삭제 버튼 클릭
4. Object Storage > 일반 버킷 > 생성 되어있는 버킷 오른쪽 (...) 클릭 > 버킷 비우기 > 생성 되어있는 버킷 오른쪽 (...) 클릭 > 버킷 삭제 > 버킷 이름 입력 > 삭제 버튼 클릭
5. MySQL > 인스턴스 그룹 > 생성 되어있는 인스턴스 그룹 오른쪽 (...) 클릭 > 인스턴스 그룹 삭제 > 인스턴스 그룹 이름 입력 > 삭제 버튼 클릭
6. Data Catalog > 카탈로그 > 생성 되어있는 클러스터 오른쪽 (...) 클릭 > 카탈로그 삭제 > 카탈로그 이름 입력 > 삭제 버튼 클릭
7. Data Query > 데이터 원본 관리 > 생성 되어있는 데이터 원본 오른쪽 (...) 클릭 > 데이터 원본 삭제 > 데이터 원본 이름 입력 > 삭제 버튼 클릭
8. Pub/Sub > 토픽 > 모두 체크 > 토픽 삭제 > 영구 삭제 입력 > 삭제 버튼 클릭
9. Advanced Managed Kafka > 클러스터 > 생성되어 있는 클러스터의 오른쪽 (...) 클릭 > 클러스터 삭제 > 클러스터 이름 입력 > 삭제 버튼 클릭
18. VPC > 퍼블릭 IP > 모두 체크 > 퍼블릭 IP 삭제 > 영구 삭제 입력 > 삭제 버튼 클릭
19. VPC > 보안 그룹 > 모두 체크 > 보안 그룹 삭제 > 영구 삭제 입력 > 삭제 버튼 클릭
20. VPC > 생성되어 있는 VPC 오른쪽 (...) 클릭 > VPC 삭제 > VPC 이름 입력 > 삭제 버튼 클릭
